ETL/Catalogs/СценарииВыполненияПроцедурSQL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СценарииВыполненияПроцедурSQL</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПроцедурыSQL</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПроцедураSQL</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроцедурыSQL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/СценарииВыполненияПроцедурSQL/Ext/ManagerModule.bsl
Процедура ВыполнитьСценарий(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СценарииВыполненияПроцедурSQLПроцедурыSQL.ПроцедураSQL КАК ПроцедураSQL
		|ИЗ
		|	Справочник.СценарииВыполненияПроцедурSQL.ПроцедурыSQL КАК СценарииВыполненияПроцедурSQLПроцедурыSQL
		|ГДЕ
		|	СценарииВыполненияПроцедурSQLПроцедурыSQL.Ссылка = &Ссылка
		|	И СценарииВыполненияПроцедурSQLПроцедурыSQL.Активна
		|
		|УПОРЯДОЧИТЬ ПО
		|	СценарииВыполненияПроцедурSQLПроцедурыSQL.НомерСтроки";   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Справочники.ПроцедурыSQL.ВыполнитьПроцедуруSQL(Выборка.ПроцедураSQL) Тогда
			ВызватьИсключение "Ошибка выполнения сценария";  
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
